/**
 *  template.c
 *
 *  this is template file.
 */
#include "ev3api.h"
#include <stdarg.h>
#include <syssvc/serial.h>
#include "TSK_Bt.h"
#include "UTIL/util.h"


/*****************************************************************************/
/*                                外部変数宣言                               */
/*****************************************************************************/
extern uint8_t rcv_msg_buf[];
extern uint8_t snd_msg_buf[];
extern uint8_t rcv_msg_len;
extern uint8_t snd_msg_len;

/*****************************************************************************/
/*                                外部定数定義                               */
/*****************************************************************************/
extern const int BT_RECV_BUF_SIZE;

/*****************************************************************************/
/*                                  外部関数                                 */
/*****************************************************************************/
extern void cmd_handle_main(void);

extern void restart_bt_task();
extern void cmd_reset_snd_buff(void);
extern void cmd_reset_buff(void);
extern void cmd_latch_buff(void);

/*****************************************************************************/
/*                                  静的変数                                 */
/*****************************************************************************/


/*****************************************************************************/
/*                                  定数定義                                 */
/*****************************************************************************/
const FLGPTN cmd_wait_flg_ptn = (FLGPTN)1;  //b'0000001

/*****************************************************************************/
/*                                  変数定義                                 */
/*****************************************************************************/
int cmd_task_count = 0;//タスクの実行回数
bool_t cmd_task_running;

/*****************************************************************************/
/*                                  関数実装                                 */
/*****************************************************************************/
void wait_cmd_task(void);
void restart_cmd_task(void);

/**
 *  @brief  コマンド送信シーケンス
 *          (コマンド処理のメインタスク)
 *          タスクから呼び出され、一連の処理を実施する。
 */
void cmd_sequence(void) {
    cmd_latch_buff();
    cmd_reset_snd_buff();
    cmd_handle_main();
}
