/**
 *  IO_Port.c
 *
 *  Control I/O port, open, close, read and write.
 */
#include "ev3api.h"
#include <syssvc/serial.h>
#include "UTIL/util.h"

#define BT_MESSAGE_BUF_SIZE        (32)

/*****************************************************************************/
/*                                  変数定義                                 */
/*****************************************************************************/
bool_t is_connect_bt;
uint8_t bt_rcv_msg_buf[BT_MESSAGE_BUF_SIZE];
uint8_t bt_rcv_msg_len = 0;

/*****************************************************************************/
/*                                  静的変数                                 */
/*****************************************************************************/


/*****************************************************************************/
/*                                  定数定義                                 */
/*****************************************************************************/


/*****************************************************************************/
/*                                外部変数宣言                               */
/*****************************************************************************/
extern uint8_t snd_msg_buf[];
extern uint8_t snd_msg_len;

/*****************************************************************************/
/*                                外部定数定義                               */
/*****************************************************************************/


/*****************************************************************************/
/*                                  外部関数                                 */
/*****************************************************************************/


/*****************************************************************************/
/*                                  関数実装                                 */
/*****************************************************************************/
/**
 *  @brief  ポートの接続状態を確認する。
 */
void port_check_connectoin() {
    is_connect_bt = ev3_bluetooth_is_connected();
}

/**
 *  @brief  ポートとの接続状態を確認の上、データを読み込む。
 *          ポートと接続されていない場合には、読み込んだデータ長は「0」として扱う。
 */
void port_read_data() {
    if (true == is_connect_bt) {
        INIT_BUF(BT_MESSAGE_BUF_SIZE, (char *)(&bt_rcv_msg_buf[0]));
        bt_rcv_msg_len = serial_rea_dat(SIO_PORT_BT, 
            (char *)(&bt_rcv_msg_buf[0]),
            BT_MESSAGE_BUF_SIZE);
    } else {
        bt_rcv_msg_len = 0;
    }
}

/**
 *  @brief  Bluetoothの送信データを、ポートに書き込む。
 *          書き込む際にBluetoothが接続されていない場合には、何もしない。
 *          また、書き込むデータが設定されていない場合にも、何もしない。
 */
void port_write_data() {
    if ((true == is_connect_bt) && (snd_msg_len > 0)) {
        /*
         *  Bluetoothポートが接続され、かつ一定以上の送信データがセット
         *  されていた場合に、データを送信する。
         */
        serial_wri_dat(SIO_PORT_BT,
            (char *)(&snd_msg_buf[0]),
            snd_msg_len);
    }
}

/**
 *  @brief  IOポートを初期化する。
 *          ポートの接続状態(を示すフラグ)、およびBluetoothデータ受信バッファの
 *          初期化を行う。
 */
void init_io_port() {
    INIT_BUF(BT_MESSAGE_BUF_SIZE, (char *)(&bt_rcv_msg_buf[0]));

    bt_rcv_msg_len = 0;
    is_connect_bt = false;
}

/**
 *  @brief  IOポート、受信データの有無(受信データの長さ)を初期化する。
 *          (受信データの内容は、初期化しない。)
 */
void port_reset() { bt_rcv_msg_len = 0; }
